's
(
)
,
.
10
13
17
1904
1907
1962
200,000
2008
2011
2025
20th
23
28
29
30-minute
49
5
50
51
52
53
54
57
58
7
:
[
]
``
a
absence
accused
across
acting
affirming
after
against
agreed
agreement
agreements
air
airstrikes
along
already
also
although
ambiguities
amid
among
analysts
and
announced
announcing
anthem
anti-personnel
anything
are
area
areas
armed
army
artillery
asean
asia
asian
association
at
attempts
authorities
background
banned
been
between
bilateral
border
both
boundary
briefly
brokered
buildup
but
by
cambodia
cambodian
cambodia–thailand
carried
case
ceasefire
century
challenge
checkpoint
civilians
claimed
claims
clash
clashes
clear
closures
colonial
combat
commander-in-chief
community—particularly
complex
concrete
conduct
confirmed
confirming
conflict
contemporary
continued
coordinate
crises
culminate
date
day
de-escalate
death
december
defense
define
demarcation
demarcations
deployed
despite
did
diplomatic
direct
discussions
displaced
dispute
disputed
disputes
district
documents
domestic
donald
dormant
dynamics
each
efforts
emerald
emphasize
enduring
engaged
engagements
entered
episodes
erupted
escalate
established
exchanged
exchanges
external
f-16
failed
falcon
fatalities
february
fighter
fighting
fire
first
flashpoint
following
for
force
forces
french
frequent
from
frontier
fruits
fuel
further
future
general
gradually
ground
had
have
he
held
highland
highlands
his
historical
history
honour
hostilities
hun
icj
impact
imports
imprecise
in
incident
incidents
included
including
incursions
indicate
indochina
initiating
initiation
injured
injuries
installations
intense
intensified
intent
international
intertwined
intervene
into
it
its
jets
july
june
khao
khlaeoplotthuk
khmer
kingdom
landmine
largely
lasting
late
launched
leading
leaving
limited
limits
localities
locations
mainland
making
manet
mao
maps
marking
matter
may
mediating
meeting
memory
militaries
military
minister
modern
more
most
muen
multiple
mutually
nam
national
nationalist
nations
neither
nevertheless
northeastern
northern
not
number
of
often
on
one
operas
operation
operations
opposite
originates
other
out
over
overlapping
overlooking
park
passes
patrol
phana
phra
phumtham
pmn-2
politics
prasat
preah
prelude
presence
president
pressure
prevent
prevented
prime
proceedings
produced
proposals
province
provocations
ratchathani
reaffirmed
reconciling
recurring
reduce
region
reinforce
rejected
remained
renewed
repeated
republic
resolved
responded
resulting
royal
rta
rtaf
ruling
said
same
sattawa
saying
sectors
security
see
seeking
seized
self-defence
sensitivity
sentiments
separately
seriously
several
siam
side
sides
since
singing
situation
skirmish
skirmishes
soap
soldier
soldiers
sophan
sought
southeast
sovereignty
stability
stated
states
stepping
strategic
submit
subsided
surrounding
survey
ta
talks
temple
tension
tensions
territorial
territory
thai
thailand
thailand–laos
than
that
the
these
they
third
thom
time
to
tourists
treaties
treaty
triangle
triggered
trump
two
ubon
un
under
underscored
united
until
urged
use
value
vihear
volatility
want
wanted
war
was
wechayachai
were
when
which
while
wihan
wish
wished
with
would
yuen
—was
